{
    "words":["linto","firefox","snips"],
    "format": "layers-model",
    "generatedBy": "keras v2.2.4-tf",
    "convertedBy": "TensorFlow.js Converter v2.0.1.post1",
    "modelTopology": {
        "keras_version": "2.2.4-tf",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [{
                    "class_name": "GRU",
                    "config": {
                        "name": "input",
                        "trainable": true,
                        "batch_input_shape": [null, 30, 13],
                        "dtype": "float32",
                        "return_sequences": false,
                        "return_state": false,
                        "go_backwards": false,
                        "stateful": false,
                        "unroll": false,
                        "time_major": false,
                        "units": 30,
                        "activation": "linear",
                        "recurrent_activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "recurrent_initializer": {
                            "class_name": "Orthogonal",
                            "config": {
                                "gain": 1.0,
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "recurrent_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "recurrent_constraint": null,
                        "bias_constraint": null,
                        "dropout": 0.0,
                        "recurrent_dropout": 0.0,
                        "implementation": 2,
                        "reset_after": false
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 20,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "output",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 3,
                        "activation": "sigmoid",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }]
            }
        },
        "training_config": {
            "loss": "mean_squared_error",
            "metrics": ["accuracy"],
            "weighted_metrics": null,
            "sample_weight_mode": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "RMSprop",
                "config": {
                    "name": "RMSprop",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "rho": 0.8999999761581421,
                    "momentum": 0.0,
                    "epsilon": 1e-07,
                    "centered": false
                }
            }
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of1.bin"],
        "weights": [{
            "name": "dense/kernel",
            "shape": [30, 20],
            "dtype": "float32"
        }, {
            "name": "dense/bias",
            "shape": [20],
            "dtype": "float32"
        }, {
            "name": "input/kernel",
            "shape": [13, 90],
            "dtype": "float32"
        }, {
            "name": "input/recurrent_kernel",
            "shape": [30, 90],
            "dtype": "float32"
        }, {
            "name": "input/bias",
            "shape": [90],
            "dtype": "float32"
        }, {
            "name": "output/kernel",
            "shape": [20, 3],
            "dtype": "float32"
        }, {
            "name": "output/bias",
            "shape": [3],
            "dtype": "float32"
        }]
    }]
}