{
    "format": "layers-model",
    "words":["multibot"],
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.7.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                45,
                                13
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_input"
                        }
                    },
                    {
                        "class_name": "GRU",
                        "config": {
                            "name": "input",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                45,
                                13
                            ],
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 45,
                            "activation": "linear",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.1,
                            "recurrent_dropout": 0.0,
                            "implementation": 2,
                            "reset_after": false
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 45,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 20,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "output",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "mean_squared_error",
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "RMSprop",
                "config": {
                    "name": "RMSprop",
                    "learning_rate": 0.0005000000237487257,
                    "decay": 0.0,
                    "rho": 0.8999999761581421,
                    "momentum": 0.0,
                    "epsilon": 1e-07,
                    "centered": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        45,
                        45
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        45
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        45,
                        20
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [
                        20
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "input/gru_cell_2/kernel",
                    "shape": [
                        13,
                        135
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "input/gru_cell_2/recurrent_kernel",
                    "shape": [
                        45,
                        135
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "input/gru_cell_2/bias",
                    "shape": [
                        135
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output/kernel",
                    "shape": [
                        20,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}